phases.dot
digraph {
    rankdir="LR"

    dosetup -> dofetch -> do12345 -> dopatch -> prepare -> install -> dotweak -> docheck -> caveats

    do12345 [shape="box"; style="dashed"];
    dopatch [shape="box"; style="dashed"];
    prepare [shape="box"; style="dashed"];
    dotweak [shape="box"; style="dashed"];
    caveats [shape="box"; style="dashed"];
}
